[{
  "_id": {
    "$oid": "64ad772f9c3a43fc64bb44dd"
  },
  "title": "A Tropical Paradise in a Bite: McDonald's Pineapple Mango Smoothie!",
  "content": "Need a refreshing tropical escape? Look no further than McDonald's Pineapple Mango Smoothie. Bursting with the flavors of juicy pineapple and sweet mango, this smoothie is a delightful blend of tropical goodness. The smooth, icy texture is a perfect thirst quencher on a hot summer day. My only critique is that I wish the fruit flavors were a bit more pronounced, but overall, it's a tasty treat that transports you to a sunny beach with every sip.",
  "rating": 4,
  "likes": [
    {
      "$oid": "64aed2a8f586db31f5a01230"
    }
  ],
  "dislikes": [
    {
      "$oid": "64aed2aff586db31f5a01231"
    }
  ],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64ad74f29c3a43fc64bb44d5"
  },
  "userId": {
    "$oid": "64ad73069c3a43fc64bb44c4"
  }
},
{
  "_id": {
    "$oid": "64aed602f586db31f5a01243"
  },
  "title": "McDonald's Classic Cheeseburger: A Timeless Delight!",
  "content": "McDonald's has truly mastered the art of the classic cheeseburger. The perfectly seasoned beef patty, topped with a slice of melted cheese, nestled between two fluffy sesame seed buns is simply irresistible. The flavors are well-balanced, and the quality of ingredients shines through. It's a tried and true favorite that never fails to satisfy my cravings. The only reason I didn't give it a perfect five-star rating is that I wish the pickles were a bit more tangy. Nevertheless, McDonald's classic cheeseburger remains an iconic choice that always hits the spot.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": 
    {
      "content": "Thank you for your review! We're glad you had a positive experience at our store and we appreciate your support.",
      "likes": [],
      "dislikes": [],
      "comments": [],
      "edited": true,
      "datePosted": {
        "$date": "2023-07-10T16:00:00.000Z"
      }
    }
  ,
  "establishmentId": {
    "$oid": "64ad74f29c3a43fc64bb44d5"
  },
  "userId": {
    "$oid": "64aed2b2f586db31f5a01233"
  }
},
{
  "_id": {
    "$oid": "64af690d8717111d66545315"
  },
  "title": "Golden Perfection: McDonald's French Fries Are Simply Irresistible!",
  "content": "When it comes to French fries, McDonald's reigns supreme. These golden sticks of pure joy are crisp on the outside and perfectly fluffy on the inside. The level of saltiness is spot-on, and they're always served piping hot. Whether enjoyed on their own or paired with a burger, McDonald's French fries never disappoint. Their consistent quality and addictive taste make them an absolute winner. I can't resist reaching for more every time I visit. ",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64ad74f29c3a43fc64bb44d5"
  },
  "userId": {
    "$oid": "64aed2a8f586db31f5a01230"
  }
},
{
  "_id": {
    "$oid": "64af69718717111d66545316"
  },
  "title": "A Morning Staple: McDonald's Sausage McMuffin Delivers!",
  "content": "For a quick and satisfying breakfast, McDonald's Sausage McMuffin is a reliable go-to. The combination of a savory sausage patty, a slice of melty American cheese, and a perfectly toasted English muffin creates a harmonious flavor profile. The convenience of a handheld breakfast sandwich is unbeatable when you're on the go. My only suggestion would be to add a touch more seasoning to the sausage for an extra flavor kick. Nonetheless, McDonald's Sausage McMuffin remains a breakfast staple I can count on. ",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64ad74f29c3a43fc64bb44d5"
  },
  "userId": {
    "$oid": "64bf9d4b277396a7d5b725a3"
  }
},
{
  "_id": {
    "$oid": "64af69838717111d66545317"
  },
  "title": "Satisfy Your Sweet Tooth: McDonald's Apple Pie Delights!",
  "content": "McDonald's Apple Pie is a warm, flaky slice of heaven that never fails to satisfy my sweet cravings. The golden-brown crust encases a luscious apple filling with just the right amount of sweetness and a hint of cinnamon. Whether enjoyed on its own or paired with a creamy ice cream scoop, this dessert is pure indulgence. The contrast of textures between the crispy crust and the tender apples is a delight with every bite. McDonald's Apple Pie is a classic dessert that I find myself coming back to time and time again.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64ad74f29c3a43fc64bb44d5"
  },
  "userId": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  }
},
{
  "_id": {
    "$oid": "64af698a8717111d66545318"
  },
  "title": "Colonel Curry's Signature Chicken: A Spicy Delight!",
  "content": "Colonel Curry's signature chicken is a fiery feast for the taste buds. The crispy exterior gives way to tender, juicy chicken that is infused with a blend of aromatic spices. The heat level is just right, providing a satisfying kick without overwhelming the palate. The only reason I didn't give it a perfect five-star rating is that I found it slightly greasier than I prefer. Nevertheless, Colonel Curry's signature chicken is a flavorful dish that will appease any spice lover.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": true,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44bf586db31f5a0123a"
  },
  "userId": {
    "$oid": "64aed2a8f586db31f5a01230"
  }
},
{
  "_id": {
    "$oid": "64af6a4c8717111d66545319"
  },
  "title": "Savor the Richness: Colonel Curry's Coconut Curry Stew!",
  "content": "Colonel Curry's Coconut Curry Stew is a bowl of pure comfort. The fragrant aroma of coconut milk and spices fills the air as you dive into the velvety broth. Tender chunks of meat and an array of vegetables create a harmonious medley of flavors. The curry is well-balanced, with just the right amount of creaminess and a gentle heat that lingers on the palate. Each spoonful is a delight, making this stew a standout choice for curry enthusiasts.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": 
    {
      "content": "We apologize for any inconvenience you may have experienced during your visit to our store, and we appreciate your feedback as it helps us improve our services.",
      "likes": [],
      "dislikes": [],
      "comments": [],
      "edited": false,
      "datePosted": {
        "$date": "2023-07-10T16:00:00.000Z"
      }
    }
  ,
  "establishmentId": {
    "$oid": "64aed44bf586db31f5a0123a"
  },
  "userId": {
    "$oid": "64ad73069c3a43fc64bb44c4"
  }
},
{
  "_id": {
    "$oid": "64af6e058717111d6654531a"
  },
  "title": "A Vegetarian Delight: Colonel Curry's Tofu Masala!",
  "content": "Vegetarians rejoice! Colonel Curry's Tofu Masala is a satisfying option that doesn't compromise on flavor. The tofu is cooked to perfection, soaking up the rich, aromatic masala sauce. The combination of spices creates a complex and robust taste that elevates the dish. While the flavors are fantastic, I would have appreciated a larger portion of tofu to make it heartier. Nonetheless, Colonel Curry's Tofu Masala is a delightful vegetarian choice that showcases the restaurant's skillful use of spices.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44bf586db31f5a0123a"
  },
  "userId": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  }
},
{
  "_id": {
    "$oid": "64af6e0a8717111d6654531b"
  },
  "title": "Exploding with Flavor: Colonel Curry's Mango Chutney Naan!",
  "content": "Colonel Curry's Mango Chutney Naan is a culinary masterpiece that brings together the sweetness of mango and the savory goodness of freshly baked naan. The warm, pillowy bread is slathered with a generous amount of tangy mango chutney, creating a burst of flavors with every bite. The combination of textures is perfect, with the naan being fluffy on the inside and slightly crispy on the outside. This delightful accompaniment is a must-try that adds a zesty twist to any meal. ",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": 
    {
      "content": "We're sorry to hear that your expectations were not met during your recent visit to our store, and we appreciate you bringing this to our attention.",
      "likes": [],
      "dislikes": [],
      "comments": [],
      "edited": false,
      "datePosted": {
        "$date": "2023-07-10T16:00:00.000Z"
      }
    }
  ,
  "establishmentId": {
    "$oid": "64aed44bf586db31f5a0123a"
  },
  "userId": {
    "$oid": "64bf9d4b277396a7d5b725a3"
  }
},
{
  "_id": {
    "$oid": "64af6e0d8717111d6654531c"
  },
  "title": "Finish with a Sweet Note: Colonel Curry's Cardamom Rice Pudding!",
  "content": "Colonel Curry's Cardamom Rice Pudding is a comforting dessert that satisfies the sweet tooth. The creamy rice pudding is infused with aromatic cardamom, creating a delightful blend of flavors. The texture is smooth and velvety, with a hint of chewiness from the rice grains. While the sweetness level is pleasant, I would have preferred a touch more cardamom to enhance the overall taste. Nonetheless, Colonel Curry's Cardamom Rice Pudding is a comforting and flavorful way to end a meal.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44bf586db31f5a0123a"
  },
  "userId": {
    "$oid": "64aed2b2f586db31f5a01233"
  }
},
{
  "_id": {
    "$oid": "64af6e138717111d6654531d"
  },
  "title": "Jollibee's Chickenjoy: A Crispy, Flavorful Delight!",
  "content": "Jollibee's Chickenjoy is the epitome of fried chicken perfection. The golden, crispy skin encases succulent, tender meat that is bursting with flavor. Each bite is a harmonious balance of savory and slightly sweet notes, thanks to their secret marinade. The chicken is always cooked to perfection, delivering that satisfying crunch with every bite. Jollibee's Chickenjoy is a true winner and a must-try for any fried chicken lover.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44ef586db31f5a0123c"
  },
  "userId": {
    "$oid": "64ad73069c3a43fc64bb44c4"
  }
},
{
  "_id": {
    "$oid": "64af6e188717111d6654531e"
  },
  "title": "A Taste of Sweet and Tangy: Jollibee's Jolly Spaghetti!",
  "content": "Jollibee's Jolly Spaghetti offers a unique take on this classic dish. The pasta is perfectly cooked and generously coated with a sweet and tangy tomato sauce. The addition of sliced hot dogs and ground meat provides a hearty element to the dish. While the sweetness of the sauce may not be for everyone, it adds a distinct flavor that sets Jollibee's Jolly Spaghetti apart. It's a nostalgic treat that brings back childhood memories and is sure to please those seeking a twist on traditional spaghetti.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44ef586db31f5a0123c"
  },
  "userId": {
    "$oid": "64bf9d4b277396a7d5b725a3"
  }
},
{
  "_id": {
    "$oid": "64af6e1c8717111d6654531f"
  },
  "title": "A Towering Delight: Jollibee's Yumburger with Cheese!",
  "content": "Jollibee's Yumburger with Cheese is a towering masterpiece that satisfies any burger craving. The juicy beef patty is sandwiched between a soft bun and topped with a slice of creamy, melted cheese. The combination of flavors is simple yet effective, creating a satisfying experience with every bite. The only reason I didn't give it a perfect five-star rating is that I wish the bun had a bit more toasting for added texture. Nevertheless, Jollibee's Yumburger with Cheese is a go-to choice for a quick and tasty meal.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44ef586db31f5a0123c"
  },
  "userId": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  }
},
{
  "_id": {
    "$oid": "64af6e218717111d66545320"
  },
  "title": "Hearty Indulgence: Jollibee's Palabok Fiesta!",
  "content": "Jollibee's Palabok Fiesta is a delightful Filipino dish that is sure to please fans of rich, flavorful meals. The dish features rice noodles smothered in a luscious shrimp sauce and topped with a medley of toppings such as shrimp, crushed pork rinds, boiled eggs, and green onions. The combination of textures and flavors is fantastic, with each component complementing the others perfectly. Jollibee's Palabok Fiesta is a hearty indulgence that captures the essence of Filipino cuisine.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44ef586db31f5a0123c"
  },
  "userId": {
    "$oid": "64aed2b2f586db31f5a01233"
  }
},
{
  "_id": {
    "$oid": "64af6e258717111d66545321"
  },
  "title": "A Sweet Finale: Jollibee's Peach Mango Pie!",
  "content": "Jollibee's Peach Mango Pie is a sweet treat that brings together the flavors of juicy peaches and tropical mangoes in a golden, flaky crust. The filling is warm, sweet, and bursting with fruity goodness. The contrast of the crispy crust and the luscious filling creates a delightful textural experience. My only suggestion would be for a slightly larger serving size, as one pie is often not enough to satisfy my cravings. Nevertheless, Jollibee's Peach Mango Pie is a tasty and satisfying way to end a meal.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44ef586db31f5a0123c"
  },
  "userId": {
    "$oid": "64aed2a8f586db31f5a01230"
  }
},
{
  "_id": {
    "$oid": "64af6e2a8717111d66545322"
  },
  "title": "Savory Delight: Ate Rica's Bacsilog is a Breakfast Winner!",
  "content": "Ate Rica's Bacsilog is a breakfast dish that hits all the right notes. The combination of crispy bacon, fluffy garlic fried rice, and a perfectly cooked sunny-side-up egg creates a symphony of flavors. The bacon is savory and adds a satisfying crunch, while the garlic fried rice is fragrant and packed with taste. The runny yolk from the egg adds a creamy element that brings everything together. Ate Rica's Bacsilog is a definite winner for a hearty and delicious breakfast.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": 
    {
      "content": "We strive to provide exceptional customer service, and we're sorry to hear that we fell short of your expectations. We value your feedback and will use it to make improvements moving forward.",
      "likes": [],
      "dislikes": [],
      "comments": [],
      "edited": false,
      "datePosted": {
        "$date": "2023-07-10T16:00:00.000Z"
      }
    }
  ,
  "establishmentId": {
    "$oid": "64aed44df586db31f5a0123b"
  },
  "userId": {
    "$oid": "64bf9d4b277396a7d5b725a3"
  }
},
{
  "_id": {
    "$oid": "64af6e2f8717111d66545323"
  },
  "title": "A Meat Lover's Dream: Ate Rica's Bacsilog with Tocilog!",
  "content": "For meat lovers, Ate Rica's Bacsilog with Tocilog is a dream come true. This version of the popular dish features tender and flavorful pieces of marinated tocino, alongside the classic garlic fried rice and sunny-side-up egg. The tocino is sweet and succulent, creating a delightful contrast with the savory rice and creamy egg. My only slight criticism is that the portion of tocino could be more generous to make it a truly meaty experience. Nonetheless, Ate Rica's Bacsilog with Tocilog is a meat lover's delight. ",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44df586db31f5a0123b"
  },
  "userId": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  }
},
{
  "_id": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  },
  "title": "Spicy Goodness: Ate Rica's Spicy Bacsilog Packs a Punch!",
  "content": "If you're a fan of spicy food, Ate Rica's Spicy Bacsilog is a must-try. This version of the dish takes the classic bacsilog and adds a fiery kick. The combination of crispy bacon, spicy garlic fried rice, and a perfectly cooked sunny-side-up egg creates a symphony of flavors that will awaken your taste buds. The spice level is on point, adding an exciting dimension to the dish without overpowering the other flavors. Ate Rica's Spicy Bacsilog is a bold and flavorful choice for those who love some heat.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44df586db31f5a0123b"
  },
  "userId": {
    "$oid": "64aed2b2f586db31f5a01233"
  }
},
{
  "_id": {
    "$oid": "64af6e388717111d66545325"
  },
  "title": "A Vegetarian Twist: Ate Rica's Tofusilog Shines!",
  "content": "For vegetarians, Ate Rica's Tofusilog offers a delicious alternative. This version of the dish replaces the bacon with marinated and grilled tofu, providing a protein-packed option. The tofu is well-seasoned and adds a delightful chewiness to each bite. The garlic fried rice and sunny-side-up egg remain as flavorful companions. My only suggestion would be to enhance the marinade or sauce for the tofu to make it even more enticing. Nevertheless, Ate Rica's Tofusilog is a tasty and satisfying vegetarian choice.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44df586db31f5a0123b"
  },
  "userId": {
    "$oid": "64aed2a8f586db31f5a01230"
  }
},
{
  "_id": {
    "$oid": "64af6e3d8717111d66545326"
  },
  "title": "A Sweet Ending: Ate Rica's Chocsilog Brings Joy!",
  "content": "Ate Rica's Chocsilog is a delightful twist on the classic bacsilog, offering a sweet ending to your meal. This version features tender and sweet chocolate-marinated beef, along with the familiar garlic fried rice and sunny-side-up egg. The chocolate infusion adds a unique and delicious element to the dish, creating a pleasant surprise with every bite. Ate Rica's Chocsilog is a treat for those with a sweet tooth and a fantastic way to finish your dining experience.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44df586db31f5a0123b"
  },
  "userId": {
    "$oid": "64ad73069c3a43fc64bb44c4"
  }
},
{
  "_id": {
    "$oid": "64af6e428717111d66545327"
  },
  "title": "Flavorful and Tender: 24Chicken's Signature Fried Chicken Delights!",
  "content": "24Chicken's signature fried chicken is a true standout. The golden-brown crispy skin gives way to succulent and juicy meat that is packed with flavor. Each bite is a delightful combination of savory and aromatic notes that leave you craving for more. The chicken is expertly seasoned, resulting in a perfectly balanced taste. 24Chicken's signature fried chicken is a must-try for all fried chicken enthusiasts.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": true,
  "images": [
    "/static/assets/reviewPics/arb1.jpg",
    "/static/assets/reviewPics/arb1.jpg",
    "/static/assets/reviewPics/arb1.jpg",
    "/static/assets/reviewPics/arb1.jpg"
  ],
  "videos": [
    "/static/assets/sheep_-_57647 (1080p).mp4"
  ],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44af586db31f5a01239"
  },
  "userId": {
    "$oid": "64bf9d4b277396a7d5b725a3"
  }
},
{
  "_id": {
    "$oid": "64af6e468717111d66545328"
  },
  "title": "A Fusion Twist: 24Chicken's Korean-Style Wings Bring the Heat!",
  "content": "If you're a fan of spicy food, 24Chicken's Korean-style wings are a treat. These wings are coated in a fiery gochujang-based sauce that packs a punch. The heat level is intense but well-balanced with the sweet and tangy flavors of the sauce. The wings themselves are crispy on the outside and tender on the inside. My only slight criticism is that the sauce could be more evenly distributed on the wings for a consistent flavor experience. Nonetheless, 24Chicken's Korean-style wings are a delicious and spicy option.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": 
    {
      "content": "Thank you for sharing your concerns with us. We take customer feedback seriously and will address the issues you've raised to ensure a better experience for all our customers.",
      "likes": [],
      "dislikes": [],
      "comments": [],
      "edited": false,
      "datePosted": {
        "$date": "2023-07-10T16:00:00.000Z"
      }
    }
  ,
  "establishmentId": {
    "$oid": "64aed44af586db31f5a01239"
  },
  "userId": {
    "$oid": "64aed2b2f586db31f5a01233"
  }
},
{
  "_id": {
    "$oid": "64af6e4a8717111d66545329"
  },
  "title": "A Unique Delight: 24Chicken's Salted Egg Chicken Rice Bowl!",
  "content": "24Chicken's Salted Egg Chicken Rice Bowl is a unique and delectable dish. The tender chicken is coated in a luscious and creamy salted egg sauce that is rich and flavorful. The combination of the savory chicken, fragrant rice, and the luxurious salted egg sauce creates a harmonious medley of flavors. The dish is well-balanced and satisfying, making it a standout choice at 24Chicken. ",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44af586db31f5a01239"
  },
  "userId": {
    "$oid": "64aed2a8f586db31f5a01230"
  }
},
{
  "_id": {
    "$oid": "64af6e4e8717111d6654532a"
  },
  "title": "Crispy Goodness: 24Chicken's Garlic Parmesan Fries are a Must-Try!",
  "content": "24Chicken's Garlic Parmesan Fries are a delightful twist on classic fries. These crispy fries are generously coated in a garlic-infused seasoning and topped with a sprinkle of Parmesan cheese. The flavors are robust and the combination of garlic and cheese adds a delicious savory element. My only small critique is that occasionally the fries could be slightly inconsistent in terms of crispiness. Nevertheless, 24Chicken's Garlic Parmesan Fries are a tasty and addictive side option.",
  "rating": 4,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44af586db31f5a01239"
  },
  "userId": {
    "$oid": "64ad73069c3a43fc64bb44c4"
  }
},
{
  "_id": {
    "$oid": "64af6e548717111d6654532b"
  },
  "title": "Sweet and Savory Harmony: 24Chicken's Honey Butter Biscuit Sticks!",
  "content": "24Chicken's Honey Butter Biscuit Sticks are a heavenly treat that combines the perfect balance of sweet and savory. These crispy and flaky biscuit sticks are coated in a luscious honey butter glaze that creates a delightful explosion of flavors. The sweetness of the honey and the richness of the butter complement each other perfectly. 24Chicken's Honey Butter Biscuit Sticks are an irresistible snack or dessert option that will leave you wanting more.",
  "rating": 5,
  "likes": [],
  "dislikes": [],
  "edited": false,
  "images": [],
  "videos": [],
  "datePosted": {
    "$date": "2023-07-10T16:00:00.000Z"
  },
  "estabResponse": null,
  "establishmentId": {
    "$oid": "64aed44af586db31f5a01239"
  },
  "userId": {
    "$oid": "64bf9dc0277396a7d5b725a4"
  }
}]